## Series

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
a=pd.Series([1,2,3,4,5])

In [4]:
type(a.dtype)

numpy.dtype[int64]

In [5]:
b={"day1": 420, "day2": 380, "day3": 390}

c=pd.Series(b)
print(c)

day1    420
day2    380
day3    390
dtype: int64

In [6]:
marks=[34,56,43,65,76,87,34,34,54,65]
name=['sohan','ram','mohan','prashant','rohit','abhishek','gabbar','himanshu','ankit','raushan']

classMarks=pd.Series(data=marks,index=name)
print(classMarks)

sohan       34
ram         56
mohan       43
prashant    65
rohit       76
abhishek    87
gabbar      34
himanshu    34
ankit       54
raushan     65
dtype: int64

In [7]:
data=pd.read_csv('./data/random.csv',header=None).squeeze('columns')
# print(data)
data

0    67.720033
1     6.217307
2    37.743532
3    37.556650
4    32.792233
5    51.034497
6    57.462068
7     9.021376
8    93.856161
9    95.177522
Name: 0, dtype: float64

In [8]:
survey=pd.read_csv('./data/annual-survey.csv',usecols=['value']).squeeze('columns')
# print(survey)
survey

0      46134
1          0
2        279
3       8187
4       8866
       ...
105        0
106      169
107       36
108       36
109      489
Name: value, Length: 110, dtype: object

In [9]:
data.head()

0    67.720033
1     6.217307
2    37.743532
3    37.556650
4    32.792233
Name: 0, dtype: float64

In [10]:
survey.head()

0    46134
1        0
2      279
3     8187
4     8866
Name: value, dtype: object

In [11]:
survey_data=pd.read_csv('./data/annual-survey.csv')

In [12]:
survey_data.head()

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [13]:
survey_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   year                  110 non-null    int64
 1   industry_code_ANZSIC  110 non-null    object
 2   industry_name_ANZSIC  110 non-null    object
 3   rme_size_grp          110 non-null    object
 4   variable              110 non-null    object
 5   value                 110 non-null    object
 6   unit                  110 non-null    object
dtypes: int64(1), object(6)
memory usage: 6.1+ KB

In [14]:
survey_data.describe()

         year
count   110.0
mean   2011.0
std       0.0
min    2011.0
25%    2011.0
50%    2011.0
75%    2011.0
max    2011.0

## DataFrames

In [15]:
import numpy as np

In [16]:
a= np.random.randn(5,5)
# print(a)
a

array([[ 0.47015864,  0.21648003, -0.18310052,  0.0791715 , -0.75934457],
       [ 0.59725359, -0.03041083,  1.84241985,  0.29323343,  0.53089247],
       [ 1.8410049 , -0.39974197, -0.52752686,  1.06836459,  0.02850516],
       [-2.56410041, -0.46885918, -0.70932893,  1.28134732,  0.11159344],
       [-1.07162844, -0.67570619,  0.39557396,  0.0762196 ,  2.53820775]])

In [17]:
df=pd.DataFrame(a,columns=['a','b','c','d','e'])
# print(df)
df

          a         b         c         d         e
0  0.470159  0.216480 -0.183101  0.079171 -0.759345
1  0.597254 -0.030411  1.842420  0.293233  0.530892
2  1.841005 -0.399742 -0.527527  1.068365  0.028505
3 -2.564100 -0.468859 -0.709329  1.281347  0.111593
4 -1.071628 -0.675706  0.395574  0.076220  2.538208

In [22]:
df1=pd.read_csv('./data/startups.csv')
# print(df1)
df1.head(5)

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [19]:
df1.size

250

In [20]:
df1.shape

(50, 5)

In [27]:
# making different dataframes based on any condition

df1_not_florida=df1[df1['State']!='Florida']
df1_not_florida.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
3  144372.41       118671.85        383199.62    New York  182901.99
5  131876.90        99814.71        362861.36    New York  156991.12
6  134615.46       147198.87        127716.82  California  156122.51

In [28]:
df1_florida=df1[df1['State']=='Florida']
df1_florida.head()

    R&D Spend  Administration  Marketing Spend    State     Profit
2   153441.51       101145.55        407934.54  Florida  191050.39
4   142107.34        91391.77        366168.42  Florida  166187.94
7   130298.13       145530.06        323876.68  Florida  155752.60
10  101913.08       110594.11        229160.95  Florida  146121.95
12   93863.75       127320.38        249839.44  Florida  141585.52